/*
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer:ในfuncton เดียว ด้วยcallback สามารถใช้งานได้หลายคำสั่งที่แต่ต่างกัน ทำให้แก้และจัดส่วนฦcodeง่าย


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร
Answer: ง่ายขึ้นและไม่ซับซ้อนเขียนหลายบรรทัดเมื่อเทียบกับการเขียนfunctionแยก


3. หากต้องสอนเพื่อนให้เข้าใจ allback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร
Answer: คือการรวมคำสั่งในส่วนเดี่ยวกันและแยกใช้แต่ละคำสั่งด้วยการexecite functionเดียวได้

*/
